test/fields/cases/freestreamPatchTypes/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 5;

boundaryField
{
    // Both freestream forms carry a freestreamValue away from the internal field, so
    // an expectation of the internal value can only come from the Neumann behaviour
    // each one translates to.
    xMax
    {
        type            freestreamPressure;
        freestreamValue uniform 11;
    }

    yMin
    {
        type            freestream;
        freestreamValue uniform 13;
    }

    ".*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
